"""
docstring - documentation string - это строка, которая используется
для описаний:
    * функций
    * классов
    * модулей/пакетов
    * файлов с кодом :)

Данная docstsing'a - есть пример документации файла!
"""

def factorial(n):
    """
    factorial:
        -  функция для подсчета факториала натурального аргумента (кратко описывается физ.смысл функции)
    input:
        - блок с описанием входных параметров (физ.смысл / бизнес смысл)
        - n :int - это натуральное число
    output:
        - блок с описанием выходных значений
    """
    res = 1
    if n <= 1:
        return res
    for i in range(2, n+1):
        res *= i
    return res


def main():
    """
    main:
        Основная точка входа в приложение. Выполняется последовательность действий:
        - ...
        - ...
        - ...
    """
    n = int(input().strip())
    for i in range(n+1):
        print(f"{i}! = {factorial(i)}")
main()