# Пример решения задачи L
msg = input()
print(msg)

i = 0
while True:
    # Отсечка справа (когда индекс нечетный) только в случае, если в остатке больше 2 символов
    if len(msg) > 2 and i % 2 != 0:
        msg = msg[:-2]
        i += 1
    # Отсечка слева (когда индекс четный), только в случае если в ослове больше 2 символов
    elif len(msg) > 2 and i % 2 == 0:
        msg = msg[2:]
        i += 1
    # Остановка если в слове остался 1 или 2 символа
    elif len(msg) == 1 or len(msg) == 2:
        break
    
    print(msg)